{"Unnamed: 0":{"0":0},"recipe_id":{"0":222388},"recipe_name":{"0":"Homemade Bacon"},"aver_rate":{"0":5.0},"image_url":{"0":"https:\/\/images.media-allrecipes.com\/userphotos\/720x405\/876328.jpg"},"review_nums":{"0":3},"ingredients":{"0":"pork belly^smoked paprika^kosher salt^ground black pepper"},"cooking_directions":{"0":"{'directions': u'Prep\\n5 m\\nCook\\n2 h 45 m\\nReady In\\n11 h 50 m\\nPreheat oven to 200 degrees F (95 degrees C).\\nSeason pork belly with paprika, salt, and pepper. Tightly wrap pork twice in heavy-duty aluminum foil. Place on a baking sheet and bake in the preheated oven for 2 1\/2 hours. Turn off the oven; let pork rest in the oven for 1 hour. Remove meat from oven, leaving it wrapped in aluminum foil, and refrigerate at least 8 hours or overnight.\\nRemove pork from foil and slice across the grain in 1\/4-inch thick slices. Working in batches, cook pork in a non-stick skillet over medium heat until golden and crisped, 6 to 8 minutes per slice.'}"},"nutritions":{"0":"{u'niacin': {u'hasCompleteData': False, u'name': u'Niacin Equivalents', u'amount': 9.319291, u'percentDailyValue': u'72', u'displayValue': u'9', u'unit': u'mg'}, u'sugars': {u'hasCompleteData': True, u'name': u'Sugars', u'amount': 0.09355932, u'percentDailyValue': u'0', u'displayValue': u'0.1', u'unit': u'g'}, u'sodium': {u'hasCompleteData': True, u'name': u'Sodium', u'amount': 2017.13, u'percentDailyValue': u'81', u'displayValue': u'2017', u'unit': u'mg'}, u'carbohydrates': {u'hasCompleteData': True, u'name': u'Carbohydrates', u'amount': 1.797819, u'percentDailyValue': u'< 1', u'displayValue': u'1.8', u'unit': u'g'}, u'vitaminB6': {u'hasCompleteData': False, u'name': u'Vitamin B6', u'amount': 0.2329798, u'percentDailyValue': u'15', u'displayValue': u'< 1', u'unit': u'mg'}, u'calories': {u'hasCompleteData': True, u'name': u'Calories', u'amount': 308.1481, u'percentDailyValue': u'15', u'displayValue': u'308', u'unit': u'kcal'}, u'thiamin': {u'hasCompleteData': False, u'name': u'Thiamin', u'amount': 0.3947737, u'percentDailyValue': u'39', u'displayValue': u'< 1', u'unit': u'mg'}, u'fat': {u'hasCompleteData': True, u'name': u'Fat', u'amount': 23.58587, u'percentDailyValue': u'36', u'displayValue': u'23.6', u'unit': u'g'}, u'folate': {u'hasCompleteData': False, u'name': u'Folate', u'amount': 2.109131, u'percentDailyValue': u'1', u'displayValue': u'2', u'unit': u'mcg'}, u'caloriesFromFat': {u'hasCompleteData': True, u'name': u'Calories from Fat', u'amount': 212.2728, u'percentDailyValue': u'-', u'displayValue': u'212', u'unit': u'kcal'}, u'calcium': {u'hasCompleteData': False, u'name': u'Calcium', u'amount': 11.18365, u'percentDailyValue': u'1', u'displayValue': u'11', u'unit': u'mg'}, u'fiber': {u'hasCompleteData': True, u'name': u'Dietary Fiber', u'amount': 0.5318869, u'percentDailyValue': u'2', u'displayValue': u'0.5', u'unit': u'g'}, u'magnesium': {u'hasCompleteData': False, u'name': u'Magnesium', u'amount': 21.65558, u'percentDailyValue': u'8', u'displayValue': u'22', u'unit': u'mg'}, u'iron': {u'hasCompleteData': False, u'name': u'Iron', u'amount': 1.240848, u'percentDailyValue': u'12', u'displayValue': u'1', u'unit': u'mg'}, u'cholesterol': {u'hasCompleteData': True, u'name': u'Cholesterol', u'amount': 61.7375, u'percentDailyValue': u'21', u'displayValue': u'62', u'unit': u'mg'}, u'protein': {u'hasCompleteData': True, u'name': u'Protein', u'amount': 21.00254, u'percentDailyValue': u'42', u'displayValue': u'21', u'unit': u'g'}, u'vitaminA': {u'hasCompleteData': False, u'name': u'Vitamin A - IU', u'amount': 474.2073, u'percentDailyValue': u'9', u'displayValue': u'474', u'unit': u'IU'}, u'potassium': {u'hasCompleteData': False, u'name': u'Potassium', u'amount': 347.2267, u'percentDailyValue': u'10', u'displayValue': u'347', u'unit': u'mg'}, u'saturatedFat': {u'hasCompleteData': True, u'name': u'Saturated Fat', u'amount': 7.736815, u'percentDailyValue': u'39', u'displayValue': u'7.7', u'unit': u'g'}, u'vitaminC': {u'hasCompleteData': False, u'name': u'Vitamin C', u'amount': 0.7761272, u'percentDailyValue': u'1', u'displayValue': u'< 1', u'unit': u'mg'}}"},"reviews":{"0":"{8542392: {'rating': 5, 'followersCount': 11, 'madeRecipesCount': 18, 'favoritesCount': 200, 'dateLastModified': u'2017-04-22T12:46:43.663', 'text': u\"Best breakfast ever! I ran out of paprika while seasoning, so I used garlic piercer on the other half of the batch. Very good! Can't wait to make it again... and figure out how to use the drippings!\", 'followingCount': 0}, 11174581: {'rating': 5, 'followersCount': 8, 'madeRecipesCount': 55, 'favoritesCount': 101, 'dateLastModified': u'2013-06-20T15:50:25.96', 'text': u\"Awesome!\\nIt's amazing.\", 'followingCount': 0}, 8262477: {'rating': 5, 'followersCount': 0, 'madeRecipesCount': 1, 'favoritesCount': 52, 'dateLastModified': u'2015-02-14T07:27:51.307', 'text': u'The flavors came together well and it really was simple to prepare. My husband and I both enjoyed it!', 'followingCount': 0}}\n"}}